{
  "AdjustableBarGraph":{
    "title":"Adjustable Bar Graph",
    "description":"This widget allows the user to assign percent values to a variable number of bars in a bar graph, with the restriction that the percent values associated with the bars must all sum to 1.0. The inspiration for this widget was from an idea for a classroom grade-tracking application, where users enter information about each of their classes. This widget would be used to help the user manually enter their grade breakdowns for each of their courses, assignments, etc."
  },
  "2048":{
    "title":"Two to the Eleventh",
    "description":"This is a clone of the popular game '2048', where the user shifts tiles around a 4x4 board using the arrow keys, trying to combine like tiles to get to a total of 2,048. I made this game using React as a way to practice my React skills in a complex frontend task."
  },
  "Timeline":{
    "Cisco":{
      "job_description":"Software Engineer",
      "lines":[
        "Member of the IoT and Apps team"
      ]
    },
    "Project RAISE":{
      "job_description":"Junior iOS Developer",
      "lines":[
        "Designed system architecture for complex user experience",
        "Managed small group: followed agile development principles",
        "Drove UX development cycle, including storyboarding and user testing",
        "Designed and developed modules within larger iOS app codebase"
      ]
    },
    "Amazon":{
      "job_description":"Summer Software Development Engineering Intern",
      "lines":[
        "Member of the Visual Search and Mobile Innovation team",
        "Developed new UX for the Camera Search feature on Amazon Mobile iOS app",
        "Designed and developed backend Java service to handle responses and requests to and from this new UX",
        "Researched and implemented a scalable React Native hybrid app approach for search features"
      ]
    },
    "RedLance Comics":{
      "job_description":"Junior Unity Intern",
      "lines":[
        "Unpaid internship learning cross-platform app development in Unity",
        "Learned about layouts, database connectivity, advertisement integration, animation",
        "Worked remotely with developers around the country"
      ]
    }
  },
  "About":{
    "main":"I am a newly-graduated Computer Science major from UMass Amherst, Class of 2018.",
    "secondary":[
      "In my time at UMass I studied a variety of topics in the field of Computer Science including Web Design, Neural Networks for Computer Vision, Human Computer Interaction, and Natural Language Processing.",
      "I am an avid learner with a passion for creation and design.",
      "My goal in my career is to make software that makes people's lives easier: whether that is developing engaging and responsive user interfaces, or training smart models to automate complex tasks, I want the users who interact with my work to have a pain-free experience."
    ]
  }
}
