{
  "Spring 2018":{
    "gpa":"3.881",
    "classes":[
      {
        "title":"Intelligent Visual Computing",
        "description":[
          "Leveraged neural networks and other machine learning algorithms to solve problems related to images and 3D models.",
          "Some problems included image classification using Convolutional Neural Networks, surface denoising using Conditional Random Fields, and mapping voice recordings to facial animations via Long Short-Term Memory RNN",
          "Language: MATLAB"
        ]
      },
      {
        "title":"Practice & Application of Data Management",
        "description":[
          "Studied the use of PostgreSQL Database Management System to manipulate and manage large data sets, and learning the challenges and solution that arise thereof.",
          "Topics included Views, SQL Injection and how to prevent it, Boyce-Codd Normal Form, Hadoop and MapReduce, Parallelization, ER Modelling, and Database Tuning.",
          "Languages: SQL, Java, Pig"
        ]
      },
      {
        "title":"Computational Linguistics: Use & Meaning",
        "description":[
          "Covered advanced methods in analyzing text and processing natural language with the use the Natural Language Toolkit.",
          "Investigated different applications of Supervised Learning for linguistic analysis.",
          "Language: Python"
        ]
      },
      {
        "title":"Language Acquisition",
        "description":[
          "Investigated linguistic theory and how it can explain the paths of acquisition which children take in learning their first language.",
          "Conducted rigorous social experiments to capture linguistic knowledge of particpants to draw conclusions about innate linguistic abilities.",
          "Explored what language acquisition reveals about the human mind, and the uniqueness and innateness of human language and cognition."
        ]
      }
    ]
  },
  "Fall 2017":{
    "gpa":"3.866",
    "classes":[
      {
        "title":"Machine Learning",
        "description":[
          "Introduced to a wide variety of state-of-the-art machine learning algorithms and their respective implementations",
          "Problem solving using the sklearn library in Python, competing amongst classmates via Kaggle for optimal solutions to homework problems",
          "Focused both on practical usage of machine learning algorithms and the underlying theory and mathematical proofs behind them.",
          "Language: Python"
        ]
      },
      {
        "title":"Intro to Human-Computer Interaction",
        "description":[
          "Introduced to principles of design within and outside the realm of UX development",
          "Implemented front-end design for novel iOS app for final project",
          "Discussed and practiced full UX design cycle including user interviews, testing, paper mockups and other low-fidelity protoyping methods.",
          "Language: Swift"
        ]
      },
      {
        "title":"Natural Language Processing",
        "description":[
          "Investigated state-of-the-art natural language processing algorithms and problem-solving methods from an analytical perspective",
          "Implemented several powerful NLP algorithms for tasks such as sentiment analysis, POS tagging, and word sense disambiguation (among others)",
          "For final project, worked in group of 3 to develop novel supervised learning method for generating song lyrics based on genre.",
          "Language: Python"
        ]
      },
      {
        "title":"Intro to Computational Linguistics",
        "description":[
          "Introductory NLP class from a Linguistics perspective",
          "Exploration of different manners of problem-solving within the NLTK library",
          "Language: Python"
        ]
      }
    ]
  },
  "Spring 2017":{
    "gpa":"3.863",
    "classes":[
      {
        "title":"Web Programming",
        "description":[
          "Team-based learning class covering methods of developing modern, secure websites",
          "Introduction to Bootstrap, React, and MongoDB",
          "For class project, worked in team of 4 to develop React website: novel text editor for songwriters that suggests rhyming words, synonyms, etc.",
          "Languages: HTML, CSS, JSX, ES6"
        ]
      },
      {
        "title":"Artificial Intelligence",
        "description":[
          ""
        ]
      },
      {
        "title":"Social Issues in Computing",
        "description":[
          ""
        ]
      },
      {
        "title":"Introduction to Syntax",
        "description":[
          ""
        ]
      }
    ]
  },
  "Fall 2016":{
    "gpa":"3.833",
    "classes":[
      {
        "title":"Introduction to Algorithms",
        "description":[
          ""
        ]
      },
      {
        "title":"Image Synthesis",
        "description":[
          ""
        ]
      },
      {
        "title":"Intro to HTML/CSS",
        "description":[
          ""
        ]
      }
    ]
  },
  "Spring 2016":{
    "gpa":"3.728",
    "classes":[
      {
        "title":"Introduction to Computation",
        "description":[
          ""
        ]
      },
      {
        "title":"Programming Methodology",
        "description":[
          ""
        ]
      }
    ]
  },
  "Fall 2015":{
    "gpa":"3.795",
    "classes":[
      {
        "title":"Introduction to Linear Algebra",
        "description":[
          ""
        ]
      },
      {
        "title":"Reasoning Under Uncertainty",
        "description":[
          ""
        ]
      },
      {
        "title":"Computing Systems Principles",
        "description":[
          ""
        ]
      }
    ]
  },
  "Spring 2015":{
    "gpa":"3.728",
    "classes":[
      {
        "title":"Programming with Data Structures",
        "description":[
          ""
        ]
      }
    ]
  },
  "Fall 2014":{
    "gpa":"3.635",
    "classes":[
      {
        "title":"Introduction to Problem Solving with Computers",
        "description":[
          ""
        ]
      }
    ]
  }
}
